/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "custom-section-richtext-page",
      "blocks": {
        "info_menu_1": {
          "type": "info_menu_item",
          "settings": {
            "menu_text": "CONTACT",
            "menu_link": "shopify://pages/contact-v1",
            "is_active": false
          }
        },
        "info_menu_2": {
          "type": "info_menu_item",
          "settings": {
            "menu_text": "FAQS",
            "menu_link": "shopify://pages/faq-v1",
            "is_active": false
          }
        },
        "info_menu_3": {
          "type": "info_menu_item",
          "settings": {
            "menu_text": "RETURN & REFUNDS",
            "menu_link": "shopify://pages/returns-v1",
            "is_active": true
          }
        },
        "info_menu_4": {
          "type": "info_menu_item",
          "settings": {
            "menu_text": "SHIPPING",
            "menu_link": "shopify://pages/shipping-v1",
            "is_active": false
          }
        },
        "richtext_1": {
          "type": "richtext_content",
          "settings": {
            "section_heading": "",
            "content": "<p>At <strong>Diamension</strong>, every piece is crafted with precision and care. While we hope you love your jewellery, we understand that sometimes adjustments may be needed.</p>",
            "content_gap": 42
          }
        },
        "richtext_2": {
          "type": "richtext_content",
          "settings": {
            "section_heading": "Returns",
            "content": "<ul><li>Returns are accepted on full-price pieces purchased directly from Diamension (online or retail), if they are unworn, in original condition, and returned within 14 days of delivery.</li><li>For hygiene reasons, earrings cannot be returned.</li><li>Custom, bespoke, engraved, or made-to-order pieces are final sale and cannot be returned.</li><li>Returns that do not meet these conditions will be sent back to the customer.</li><li>Once approved, store credits are issued in the form of a Diamension gift card, valid for 3 years across our website and retail stores.</li></ul><p>To request a return, please contact our team at care@diamension.com.</p>",
            "content_gap": 42
          }
        },
        "richtext_3": {
          "type": "richtext_content",
          "settings": {
            "section_heading": "Repairs",
            "content": "<p>We stand by the quality of our craftsmanship and offer repair services should your piece need attention.</p><ul><li>To initiate a repair, please email care@diamension.com with your order details.</li><li>Items must be returned in their original or secure protective packaging to avoid damage in transit.</li><li>Repair fees may apply depending on the service required. Shipping charges for repairs are borne by the client.</li><li>For international customers, repair shipping and duties will be calculated and confirmed prior to servicing.</li></ul><p>If the item does not meet our return/repair guidelines upon arrival, it will be sent back at the customer's expense.</p>",
            "content_gap": 42
          }
        },
        "richtext_4": {
          "type": "richtext_content",
          "settings": {
            "section_heading": "Recycling Program",
            "content": "<p>As part of our sustainability promise, we encourage customers to recycle their old or broken Diamension pieces.</p><ul><li>Jewellery with at least 80% of its original material may be eligible for our recycling program.</li><li>Store credits are offered based on material value (assessed by our team).</li><li>Proof of purchase is required to determine the credit value. Without proof, a fixed recycling credit will be applied.</li><li>Diamension reserves the right to decline recycling requests if the condition does not meet our guidelines.</li></ul>",
            "content_gap": 0
          }
        }
      },
      "block_order": [
        "info_menu_1",
        "info_menu_2",
        "info_menu_3",
        "info_menu_4",
        "richtext_1",
        "richtext_2",
        "richtext_3",
        "richtext_4"
      ],
      "settings": {
        "menu_title": "INFO",
        "page_title": "Returns & Repairs"
      }
    }
  },
  "order": ["main"]
}
